app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
---
<h3 class="comments_title">
 <%= @post.comments.count %> comments