app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "parentId", "votes", "level", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)