app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "body", "votes", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "body 111111111111112"], ["updated_at", "2023-06-19 02:10:35.496558"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def upvote
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def downvote
    @post = Post.find(params[:id])